// ===================== //

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

const number = parseInt(prompt('Enter a number:'));

if (isNaN(number)) {
  alert("You didn't enter a number!");
} else if (number === 10) {
  alert('True');
} else {
  alert('False');
}

// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
// ===================== //
