// ======== task-01 ======== //

// Дано масив чисел [1, 2, 3, 4, 5]. Створіть новий масив, що містить
// квадрати кожного елементу вхідного масиву.
// Очікуваний результат: [1, 4, 9, 16, 25].

// const numbers = [1, 2, 3, 4, 5];

// const squares = numbers.map((number) => number ** 2);
// const squares = numbers.map((number) => number * number);
// const squares = numbers.map((number) => {
//   return number * number;
// });

// console.log(squares);

// ========================= //
// ======== task-02 ======== //

// Дано масив об'єктів. Створіть новий масив, що містить всі значення
// з масивів values кожного об'єкту, збережених в одному масиві.
// Очікуваний результат: [1, 2, 3, 4, 5, 6, 7, 8, 9].

const data = [
  { id: 1, values: [1, 2, 3] },
  { id: 2, values: [4, 5, 6] },
  { id: 3, values: [7, 8, 9] },
];

const flattenedData = data.flatMap((item) => item.values);

console.log(flattenedData);

// ========================= //
// ======== task-03 ======== //
// ========================= //
// ======== task-04 ======== //
// ========================= //
// ======== task-05 ======== //
// ========================= //
// ======== task-06 ======== //
// ========================= //
// ======== task-07 ======== //
// ========================= //
// ======== task-08 ======== //
// ========================= //
// ======== task-09 ======== //
// ========================= //
// ======== task-10 ======== //
// ========================= //
// ======== task-11 ======== //
// ========================= //
// ======== task-12 ======== //
// ========================= //
// ======== task-13 ======== //
// ========================= //
